Revit 2027 API
RebarUpdateCurvesData.GetChangedSharedParameterGUIDs Method
 Returns an array containing the shared parameter GUIDs that were changed since the last regeneration. Array is empty if no shared params were changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Guid> GetChangedSharedParameterGUIDs()
Public Function GetChangedSharedParameterGUIDs As IList(Of Guid)
public:
IList<Guid>^ GetChangedSharedParameterGUIDs()
member GetChangedSharedParameterGUIDs : unit -> IList<Guid>
Return Value
IList<Guid>
 Returns an array containing the elementId of the shared params that were changed since the last regeneration.
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace